Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.authentik_system.data.kubernetes_service_v1.authentik_server will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service_v1" "authentik_server" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "authentik-server"
          + namespace        = "authentik"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.authentik_system.helm_release.authentik will be updated in-place
~ resource "helm_release" "authentik" {
        id                         = "authentik"
        name                       = "authentik"
      ~ version                    = "2025.4.0" -> "2025.2.4"
        # (27 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.pihole_system.helm_release.pihole will be updated in-place
~ resource "helm_release" "pihole" {
        id                         = "pihole"
        name                       = "pihole"
      ~ version                    = "2.29.1" -> "2.30.0"
        # (27 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.billv.ca/lock?id=billv-ca%252Fhomelab-atlantis-k3s-base-services%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 0 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```